# ElementRecord Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementRecord Members
ElementRecord Class Methods Properties See Also
---
The ElementRecord type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ElementRecord |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBoundingBox | Gets the bounding box of the element record. |
| GetCategoryId | Gets the category id of the element record. |
| GetDesignOptionId | Gets the design option id of the element record. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetId | Gets the id of the element record. |
| GetOwnerViewId | Gets the element id of the owner view record. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| HasBoundingBox | Determines whether this element record has a bounding box. |
| IsAnElementType | Identifies if the element record represents an ElementType. |
| IsCurveDriven | Identifies if the element is curve driven. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| WorksetId | Get Id of the workset which owns the element. |

# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace